src/Catalogs/ИС_МВМ_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МВМ_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>warehouseCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуFBO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьОрдерНаОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскоеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ИС_МВМ_Склады/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 22.03.24 УА #71892
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.03.24 УА #71892

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура ВыгружатьОстаткиИзГруппыСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураПараметров = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки();
	СтруктураПараметров.ИмяРеквизитаАдресаДоставки 				= "АдресДоставки";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначенияПолей = "АдресДоставкиЗначенияПолей";
	СтруктураПараметров.ИмяРеквизитаАдресаДоставкиЗначение 		= "АдресДоставкиЗначение";  
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	    Элемент,
		Объект,
		СтруктураПараметров,
		СтандартнаяОбработка);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
		Объект.АдресДоставки,
		Объект.АдресДоставкиЗначенияПолей,
		Объект.АдресДоставкиЗначение);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 04.04.23 УА #57127
&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 05.04.23 УА #57127
&НаКлиенте
Процедура ОбщаяГруппаСкладовПриИзменении(Элемент)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура АвтоматическиСоздаватьОрдерНаОтгрузкуПриИзменении(Элемент)
	УстановитьВидимостьОрдернойСхемы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 05.04.23 УА #57127
&НаКлиенте
Процедура УстановитьОформление()
		
	Если ЗначениеЗаполнено(Объект.ОбщаяГруппаСкладов) Тогда
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Ложь;
		Элементы.ГруппаСкладов.Видимость = Ложь;
		Объект.ВыгружатьОстаткиИзГруппыСкладов = Ложь;
	Иначе
		Элементы.ВыгружатьОстаткиИзГруппыСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Истина;
		Элементы.ГруппаСкладов.Видимость = Объект.ВыгружатьОстаткиИзГруппыСкладов;	
	КонецЕсли;

	УстановитьВидимостьОрдернойСхемы();
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 05.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 25.06.24 УА #76413
&НаКлиенте
Процедура УстановитьВидимостьОрдернойСхемы()

	Элементы.СкладскоеПомещение.Видимость 			= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусРасходногоОрдера.Видимость 		= Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;
	Элементы.СтатусСтрокиРасходногоОрдера.Видимость = Объект.АвтоматическиСоздаватьОрдерНаОтгрузку;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 25.06.24 УА #76413

#КонецОбласти
